const emojiRegex = require('emoji-regex');

// let text = 'Привет!';
// let text = '😘';
let text = '😍🤣';
// let text = 'Ч̴̨̛̛͚̟̘̬̞͌̓͒̔̍̽̽̄̿͋̂̄́͊̇̂͊́̿͐̿̄̎̌̏̂̀̀̓́̃̑̍͌͛̄̈́̌͑̓̆̌͒̍̀̋̋̏̔̂̄͆͂̓̐̕̕̚͘͝͝͝͠͝͝Ѐ̶̧̧̧̨̨̨̡̡̧̛̬̦̠͎͕̻̭̪̤͇̫̫̼̞͔͕̝̗̼̠̦̦̝̞̭̖̥͈͍̠̮̬̘͈̭͚̭͕̰̦̣̩͓̫͎̺͉͕͖̮̯̙̥͍̰̹̻̬̪̣̭̗̝̬̖̻͂̓͛̈́̇̓̈́̓̃́͒̌̒͘̚͝ͅР̶̨̢̨̢̢̨̢͎͎̣̮̤̤̘̦̜͖̦͖̦̹̩̗͎̝͉͎̞͔̤͎͔͇̱̲͔͇͉̭̝̪̲̰̩̬̜̗̲͉̠͇̠̳̦̩̥̳̗̗̩̖̼̯̞̣͉̩̮̪́̆̈̒̍̄̒̾̾̌̾̋̀̎́͝͝͝ͅͅЕ̷̨̦̮̮͚̥̭͇͔͇͍̗̭̣̱̟̖͕̻̳̺͉̻̺̟̣͍̱̗̭̠̤̜̲̘̺̯͉͂̂̉͐̑̈́͊̈̒͋̊͗̐̂͋̈́͑͑̇͘͘͠͝Ш̴̨̨̧̮̪̣̰̭̘͉͎̤̘̻̤͓̦̙̟̯̙͈̙̻̰̞̩̞̰͙̰̙͖͇̯̬̪̱͚͉̼̝̃̓̊̀̂̌̏̾̈́͆̓͌͊̒̆̊͊̈́̑̒͗͂̆̕͘͝͝͝͝Н̶̢̢̨̢̛̛̪̞̯̖̩̩̤̖̟̤̘̠͔͓̼̲͈̟̹̮̭̳̠̮̗̬̺̩̳̻̞̮͎͇̖̖͈̫̪͇̩̖͙̙̞̱̾̉́͂͐͒͌̽͑̋͒̌̓̊̿̉͋̍̿̀̏̋͗̇̓̕͜͜͜͝͝ͅЮ̷̧̧̧̢̧̛̬͍̣̜̟̖̟̖̮̘̟̙̼̻̦̰̻͎̝̲͙͕̣̠̫̠̠̫̲̖̤̬͎̺̲͔͕̟̣̱͉̺̻̰̘̜̳̠̙͇͚̬͖̬͚͔̲̖̘͎̌̾͆͐̈̒̌̃̅̍͐̈́͂̔̈̓̆̀̎͋̀͌̾́͑̆̓̍̈̽͌̿͂͋͒̅̈́̉͛̋̚̕̚͜͜͝͝ͅ ̶̩̤̰̠̣͍̯̩̦̂͊̈́̅̀̌̅͛͑̑̆̾͐̈́̒̈̓̔̒̄̑̔̒̓̇̈́͗͛̓͑͆̏̒͆̆̈́̔͗̀̔͒̿̍̌̿͋̀̂͗̇̒͑̑̑̽͑͗̂̇̒͑́̚͘͘͠͠͝͝Н̷̢̢̧̡̣̖̘̯͈̣͎͎̱̹͚̣̻̰͕͍͓̻̜̬͈͍̝̦̫̹̥̳̱͙̹͍̬̦͉͗̀̀̈́̌́̂̍͆̓̔̅̈́̾̚͜͝Е̶̨̡̢̧̡̛̪̺̤̻̥̩͚͚̯̲̫͓̘̭̹͕̰̰̜̥͈͙̮͔̫͖̝̖̬̙̩̪̲̮̰̝̞͈̦̗̩̹̹̞̟̞̬̼͔͔͉̱̜̥̪̬͓͖̟̖͔͖͕̑͂͑̆̓͊̋̌̆̿̈͂͊̀̏͊͗͐̊̏́̒̃̀̐̈́̈́̂͊̎̓̊̾̽͜͜͝͠͝ͅͅС̶̨̧̡̧̡̧̧̡̨̢̨̛͓͍͔̠̫̮̯̬͇̜̝̰͙͖͓̖̟̠̠̖͖͕̮̻̜͉͙̱͍̰͙̻͖͎̥̱̝̭̗͚̲̙̩̪͇͖̫͔̀́̾̌̇̄͐̈͗͗̃̾̎̀̅̎͐̓̋̐̓͗̂͋̂̈́̍͐̐͘̚̚͜͝͝ͅИ̷̧̨̡̡̨͎̳̮͚͚̹̩͉͔̬̼͕̻̭̰̥̯̲͉̼̮̯̠̗̰̟̺̜͓̤̰͇̤̝̦̯̟̭̺̲̼̪͔̠̖͙̳̬̲̳̣͈̔͑͆̎̋̓̈́͊́̍̆͋͗̉̄̽͆̿͛̊̑̕͘͜͠͝͝';
// let text = 'Привет!̍̽̽';
// let text = '😍🤣̧̨̧̡̧̡̧̧̡̨̢̨̛̻͖͓͍͔̠̫̮̯̬͇̜̝̰͙͖͓̖̟̠̠̖͖͕̮̻̜͉͙̱͍̰͙̻͖͎̥̱̝̭̗͚̲̙̩̪͇͖̫͔̍̽̽͌̓͒̔̍̽̽̄̿͋͜ͅ';

const re:RegExp = emojiRegex();

let match;
while (match = re.exec(text)) {
    const emoji = match[0];
    // @ts-ignore
    console.log(`Matched sequence ${ emoji } — code points: ${ [...emoji].length }`);
}

console.log('the end');